app/controllers/movies_controller.rb

    def index
      @sortedBy = nil
      @filterRatings = nil
      @query = Movie
      @movies = @query.all
      @allRatings = Movie.uniq.pluck('rating')
      if params.has_key?('sort_by') and Movie.column_names.include?(params[:sort_by])
---
SELECT DISTINCT "movies"."rating" FROM "movies"
SELECT "movies".* FROM "movies"  ORDER BY release_date